Ran Plan for dir: `devops-dev/global/eu-central-1/common/vpc/dev3` workspace: `devops-dev_global_eu-central-1_common_vpc_dev3`

<details><summary>Show Output</summary>

```diff
11:46:17.779 WARN   The `TERRAGRUNT_TFPATH` environment variable is deprecated and will be removed in a future version of Terragrunt. Use `TG_TF_PATH=terraform1.10.5` instead.
11:46:29.500 STDOUT terraform1.10.5: Terraform used the selected providers to generate the following execution
11:46:29.501 STDOUT terraform1.10.5: plan. Resource actions are indicated with the following symbols:
11:46:29.501 STDOUT terraform1.10.5:   + create
11:46:29.501 STDOUT terraform1.10.5: Terraform will perform the following actions:
11:46:29.501 STDOUT terraform1.10.5:   # module.vpc.aws_default_network_acl.this[0] will be created
11:46:29.501 STDOUT terraform1.10.5:   + resource "aws_default_network_acl" "this" {
11:46:29.501 STDOUT terraform1.10.5:       + arn                    = (known after apply)
11:46:29.501 STDOUT terraform1.10.5:       + default_network_acl_id = (known after apply)
11:46:29.501 STDOUT terraform1.10.5:       + id                     = (known after apply)
11:46:29.501 STDOUT terraform1.10.5:       + owner_id               = (known after apply)
11:46:29.501 STDOUT terraform1.10.5:       + tags                   = {
11:46:29.501 STDOUT terraform1.10.5:           + "Environment" = "global"
11:46:29.501 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
11:46:29.502 STDOUT terraform1.10.5:           + "Namespace"   = "common"
11:46:29.502 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:46:29.502 STDOUT terraform1.10.5:         }
11:46:29.502 STDOUT terraform1.10.5:       + tags_all               = {
11:46:29.502 STDOUT terraform1.10.5:           + "Environment" = "global"
11:46:29.572 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
11:46:29.572 STDOUT terraform1.10.5:           + "Namespace"   = "common"
11:46:29.572 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:46:29.572 STDOUT terraform1.10.5:         }
11:46:29.572 STDOUT terraform1.10.5:       + vpc_id                 = (known after apply)
11:46:29.572 STDOUT terraform1.10.5:       + egress {
11:46:29.572 STDOUT terraform1.10.5:           + action          = "allow"
11:46:29.572 STDOUT terraform1.10.5:           + from_port       = 0
11:46:29.572 STDOUT terraform1.10.5:           + ipv6_cidr_block = "::/0"
11:46:29.572 STDOUT terraform1.10.5:           + protocol        = "-1"
11:46:29.572 STDOUT terraform1.10.5:           + rule_no         = 101
11:46:29.572 STDOUT terraform1.10.5:           + to_port         = 0
11:46:29.572 STDOUT terraform1.10.5:             # (1 unchanged attribute hidden)
11:46:29.572 STDOUT terraform1.10.5:         }
11:46:29.572 STDOUT terraform1.10.5:       + egress {
11:46:29.573 STDOUT terraform1.10.5:           + action          = "allow"
11:46:29.573 STDOUT terraform1.10.5:           + cidr_block      = "0.0.0.0/0"
11:46:29.573 STDOUT terraform1.10.5:           + from_port       = 0
11:46:29.573 STDOUT terraform1.10.5:           + protocol        = "-1"
11:46:29.573 STDOUT terraform1.10.5:           + rule_no         = 100
11:46:29.573 STDOUT terraform1.10.5:           + to_port         = 0
11:46:29.573 STDOUT terraform1.10.5:             # (1 unchanged attribute hidden)
11:46:29.573 STDOUT terraform1.10.5:         }
11:46:29.573 STDOUT terraform1.10.5:       + ingress {
11:46:29.573 STDOUT terraform1.10.5:           + action          = "allow"
11:46:29.573 STDOUT terraform1.10.5:           + from_port       = 0
11:46:29.573 STDOUT terraform1.10.5:           + ipv6_cidr_block = "::/0"
11:46:29.573 STDOUT terraform1.10.5:           + protocol        = "-1"
11:46:29.573 STDOUT terraform1.10.5:           + rule_no         = 101
11:46:29.573 STDOUT terraform1.10.5:           + to_port         = 0
11:46:29.573 STDOUT terraform1.10.5:             # (1 unchanged attribute hidden)
11:46:29.573 STDOUT terraform1.10.5:         }
11:46:29.573 STDOUT terraform1.10.5:       + ingress {
11:46:29.573 STDOUT terraform1.10.5:           + action          = "allow"
11:46:29.573 STDOUT terraform1.10.5:           + cidr_block      = "0.0.0.0/0"
11:46:29.573 STDOUT terraform1.10.5:           + from_port       = 0
11:46:29.573 STDOUT terraform1.10.5:           + protocol        = "-1"
11:46:29.574 STDOUT terraform1.10.5:           + rule_no         = 100
11:46:29.574 STDOUT terraform1.10.5:           + to_port         = 0
11:46:29.574 STDOUT terraform1.10.5:             # (1 unchanged attribute hidden)
11:46:29.574 STDOUT terraform1.10.5:         }
11:46:29.574 STDOUT terraform1.10.5:     }
11:46:29.574 STDOUT terraform1.10.5:   # module.vpc.aws_default_route_table.default[0] will be created
11:46:29.574 STDOUT terraform1.10.5:   + resource "aws_default_route_table" "default" {
11:46:29.574 STDOUT terraform1.10.5:       + arn                    = (known after apply)
11:46:29.574 STDOUT terraform1.10.5:       + default_route_table_id = (known after apply)
11:46:29.574 STDOUT terraform1.10.5:       + id                     = (known after apply)
11:46:29.574 STDOUT terraform1.10.5:       + owner_id               = (known after apply)
11:46:29.574 STDOUT terraform1.10.5:       + route                  = (known after apply)
11:46:29.574 STDOUT terraform1.10.5:       + tags                   = {
11:46:29.574 STDOUT terraform1.10.5:           + "Environment" = "global"
11:46:29.574 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
11:46:29.574 STDOUT terraform1.10.5:           + "Namespace"   = "common"
11:46:29.574 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:46:29.574 STDOUT terraform1.10.5:         }
11:46:29.574 STDOUT terraform1.10.5:       + tags_all               = {
11:46:29.575 STDOUT terraform1.10.5:           + "Environment" = "global"
11:46:29.575 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
11:46:29.575 STDOUT terraform1.10.5:           + "Namespace"   = "common"
11:46:29.575 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:46:29.575 STDOUT terraform1.10.5:         }
11:46:29.575 STDOUT terraform1.10.5:       + vpc_id                 = (known after apply)
11:46:29.575 STDOUT terraform1.10.5:       + timeouts {
11:46:29.575 STDOUT terraform1.10.5:           + create = "5m"
11:46:29.575 STDOUT terraform1.10.5:           + update = "5m"
11:46:29.575 STDOUT terraform1.10.5:         }
11:46:29.575 STDOUT terraform1.10.5:     }
11:46:29.575 STDOUT terraform1.10.5:   # module.vpc.aws_default_security_group.this[0] will be created
11:46:29.575 STDOUT terraform1.10.5:   + resource "aws_default_security_group" "this" {
11:46:29.575 STDOUT terraform1.10.5:       + arn                    = (known after apply)
11:46:29.575 STDOUT terraform1.10.5:       + description            = (known after apply)
11:46:29.575 STDOUT terraform1.10.5:       + egress                 = (known after apply)
11:46:29.575 STDOUT terraform1.10.5:       + id                     = (known after apply)
11:46:29.575 STDOUT terraform1.10.5:       + ingress                = (known after apply)
11:46:29.575 STDOUT terraform1.10.5:       + name                   = (known after apply)
11:46:29.576 STDOUT terraform1.10.5:       + name_prefix            = (known after apply)
11:46:29.576 STDOUT terraform1.10.5:       + owner_id               = (known after apply)
11:46:29.576 STDOUT terraform1.10.5:       + revoke_rules_on_delete = false
11:46:29.576 STDOUT terraform1.10.5:       + tags                   = {
11:46:29.576 STDOUT terraform1.10.5:           + "Environment" = "global"
11:46:29.576 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
11:46:29.577 STDOUT terraform1.10.5:           + "Namespace"   = "common"
11:46:29.577 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:46:29.577 STDOUT terraform1.10.5:         }
11:46:29.577 STDOUT terraform1.10.5:       + tags_all               = {
11:46:29.577 STDOUT terraform1.10.5:           + "Environment" = "global"
11:46:29.577 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
11:46:29.577 STDOUT terraform1.10.5:           + "Namespace"   = "common"
11:46:29.577 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:46:29.578 STDOUT terraform1.10.5:         }
11:46:29.578 STDOUT terraform1.10.5:       + vpc_id                 = (known after apply)
11:46:29.578 STDOUT terraform1.10.5:     }
11:46:29.578 STDOUT terraform1.10.5:   # module.vpc.aws_eip.nat[0] will be created
11:46:29.578 STDOUT terraform1.10.5:   + resource "aws_eip" "nat" {
11:46:29.578 STDOUT terraform1.10.5:       + allocation_id        = (known after apply)
11:46:29.578 STDOUT terraform1.10.5:       + arn                  = (known after apply)
11:46:29.578 STDOUT terraform1.10.5:       + association_id       = (known after apply)
11:46:29.578 STDOUT terraform1.10.5:       + carrier_ip           = (known after apply)
11:46:29.578 STDOUT terraform1.10.5:       + customer_owned_ip    = (known after apply)
11:46:29.579 STDOUT terraform1.10.5:       + domain               = "vpc"
11:46:29.579 STDOUT terraform1.10.5:       + id                   = (known after apply)
11:46:29.579 STDOUT terraform1.10.5:       + instance             = (known after apply)
11:46:29.579 STDOUT terraform1.10.5:       + ipam_pool_id         = (known after apply)
11:46:29.579 STDOUT terraform1.10.5:       + network_border_group = (known after apply)
11:46:29.579 STDOUT terraform1.10.5:       + network_interface    = (known after apply)
11:46:29.579 STDOUT terraform1.10.5:       + private_dns          = (known after apply)
11:46:29.579 STDOUT terraform1.10.5:       + private_ip           = (known after apply)
11:46:29.579 STDOUT terraform1.10.5:       + ptr_record           = (known after apply)
11:46:29.580 STDOUT terraform1.10.5:       + public_dns           = (known after apply)
11:46:29.580 STDOUT terraform1.10.5:       + public_ip            = (known after apply)
11:46:29.580 STDOUT terraform1.10.5:       + public_ipv4_pool     = (known after apply)
11:46:29.580 STDOUT terraform1.10.5:       + tags                 = {
11:46:29.580 STDOUT terraform1.10.5:           + "Environment" = "global"
11:46:29.580 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
11:46:29.580 STDOUT terraform1.10.5:           + "Namespace"   = "common"
11:46:29.580 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:46:29.580 STDOUT terraform1.10.5:         }
11:46:29.580 STDOUT terraform1.10.5:       + tags_all             = {
11:46:29.581 STDOUT terraform1.10.5:           + "Environment" = "global"
11:46:29.581 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
11:46:29.581 STDOUT terraform1.10.5:           + "Namespace"   = "common"
11:46:29.581 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:46:29.581 STDOUT terraform1.10.5:         }
11:46:29.581 STDOUT terraform1.10.5:       + vpc                  = (known after apply)
11:46:29.581 STDOUT terraform1.10.5:     }
11:46:29.581 STDOUT terraform1.10.5:   # module.vpc.aws_internet_gateway.this[0] will be created
11:46:29.581 STDOUT terraform1.10.5:   + resource "aws_internet_gateway" "this" {
11:46:29.581 STDOUT terraform1.10.5:       + arn      = (known after apply)
11:46:29.581 STDOUT terraform1.10.5:       + id       = (known after apply)
11:46:29.582 STDOUT terraform1.10.5:       + owner_id = (known after apply)
11:46:29.582 STDOUT terraform1.10.5:       + tags     = {
11:46:29.582 STDOUT terraform1.10.5:           + "Environment" = "global"
11:46:29.582 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
11:46:29.582 STDOUT terraform1.10.5:           + "Namespace"   = "common"
11:46:29.582 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:46:29.582 STDOUT terraform1.10.5:         }
11:46:29.582 STDOUT terraform1.10.5:       + tags_all = {
11:46:29.582 STDOUT terraform1.10.5:           + "Environment" = "global"
11:46:29.582 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
11:46:29.582 STDOUT terraform1.10.5:           + "Namespace"   = "common"
11:46:29.583 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:46:29.583 STDOUT terraform1.10.5:         }
11:46:29.583 STDOUT terraform1.10.5:       + vpc_id   = (known after apply)
11:46:29.583 STDOUT terraform1.10.5:     }
11:46:29.583 STDOUT terraform1.10.5:   # module.vpc.aws_nat_gateway.this[0] will be created
11:46:29.583 STDOUT terraform1.10.5:   + resource "aws_nat_gateway" "this" {
11:46:29.583 STDOUT terraform1.10.5:       + allocation_id                      = (known after apply)
11:46:29.583 STDOUT terraform1.10.5:       + association_id                     = (known after apply)
11:46:29.583 STDOUT terraform1.10.5:       + connectivity_type                  = "public"
11:46:29.584 STDOUT terraform1.10.5:       + id                                 = (known after apply)
11:46:29.584 STDOUT terraform1.10.5:       + network_interface_id               = (known after apply)
11:46:29.584 STDOUT terraform1.10.5:       + private_ip                         = (known after apply)
11:46:29.584 STDOUT terraform1.10.5:       + public_ip                          = (known after apply)
11:46:29.584 STDOUT terraform1.10.5:       + secondary_private_ip_address_count = (known after apply)
11:46:29.584 STDOUT terraform1.10.5:       + secondary_private_ip_addresses     = (known after apply)
11:46:29.584 STDOUT terraform1.10.5:       + subnet_id                          = (known after apply)
11:46:29.584 STDOUT terraform1.10.5:       + tags                               = {
11:46:29.585 STDOUT terraform1.10.5:           + "Environment" = "global"
11:46:29.585 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
11:46:29.585 STDOUT terraform1.10.5:           + "Namespace"   = "common"
11:46:29.585 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:46:29.585 STDOUT terraform1.10.5:         }
11:46:29.585 STDOUT terraform1.10.5:       + tags_all                           = {
11:46:29.585 STDOUT terraform1.10.5:           + "Environment" = "global"
11:46:29.585 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
11:46:29.585 STDOUT terraform1.10.5:           + "Namespace"   = "common"
11:46:29.585 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:46:29.586 STDOUT terraform1.10.5:         }
11:46:29.586 STDOUT terraform1.10.5:     }
11:46:29.586 STDOUT terraform1.10.5:   # module.vpc.aws_route.private_nat_gateway[0] will be created
11:46:29.586 STDOUT terraform1.10.5:   + resource "aws_route" "private_nat_gateway" {
11:46:29.586 STDOUT terraform1.10.5:       + destination_cidr_block = "0.0.0.0/0"
11:46:29.586 STDOUT terraform1.10.5:       + id                     = (known after apply)
11:46:29.586 STDOUT terraform1.10.5:       + instance_id            = (known after apply)
11:46:29.586 STDOUT terraform1.10.5:       + instance_owner_id      = (known after apply)
11:46:29.586 STDOUT terraform1.10.5:       + nat_gateway_id         = (known after apply)
11:46:29.586 STDOUT terraform1.10.5:       + network_interface_id   = (known after apply)
11:46:29.586 STDOUT terraform1.10.5:       + origin                 = (known after apply)
11:46:29.587 STDOUT terraform1.10.5:       + route_table_id         = (known after apply)
11:46:29.587 STDOUT terraform1.10.5:       + state                  = (known after apply)
11:46:29.587 STDOUT terraform1.10.5:       + timeouts {
11:46:29.587 STDOUT terraform1.10.5:           + create = "5m"
11:46:29.587 STDOUT terraform1.10.5:         }
11:46:29.587 STDOUT terraform1.10.5:     }
11:46:29.587 STDOUT terraform1.10.5:   # module.vpc.aws_route.public_internet_gateway[0] will be created
11:46:29.587 STDOUT terraform1.10.5:   + resource "aws_route" "public_internet_gateway" {
11:46:29.587 STDOUT terraform1.10.5:       + destination_cidr_block = "0.0.0.0/0"
11:46:29.587 STDOUT terraform1.10.5:       + gateway_id             = (known after apply)
11:46:29.588 STDOUT terraform1.10.5:       + id                     = (known after apply)
11:46:29.588 STDOUT terraform1.10.5:       + instance_id            = (known after apply)
11:46:29.588 STDOUT terraform1.10.5:       + instance_owner_id      = (known after apply)
11:46:29.588 STDOUT terraform1.10.5:       + network_interface_id   = (known after apply)
11:46:29.588 STDOUT terraform1.10.5:       + origin                 = (known after apply)
11:46:29.588 STDOUT terraform1.10.5:       + route_table_id         = (known after apply)
11:46:29.588 STDOUT terraform1.10.5:       + state                  = (known after apply)
11:46:29.588 STDOUT terraform1.10.5:       + timeouts {
11:46:29.588 STDOUT terraform1.10.5:           + create = "5m"
11:46:29.588 STDOUT terraform1.10.5:         }
11:46:29.588 STDOUT terraform1.10.5:     }
11:46:29.588 STDOUT terraform1.10.5:   # module.vpc.aws_route_table.private[0] will be created
11:46:29.588 STDOUT terraform1.10.5:   + resource "aws_route_table" "private" {
11:46:29.588 STDOUT terraform1.10.5:       + arn              = (known after apply)
11:46:29.589 STDOUT terraform1.10.5:       + id               = (known after apply)
11:46:29.589 STDOUT terraform1.10.5:       + owner_id         = (known after apply)
11:46:29.589 STDOUT terraform1.10.5:       + propagating_vgws = (known after apply)
11:46:29.589 STDOUT terraform1.10.5:       + route            = (known after apply)
11:46:29.589 STDOUT terraform1.10.5:       + tags             = {
11:46:29.589 STDOUT terraform1.10.5:           + "Environment" = "global"
11:46:29.589 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
11:46:29.589 STDOUT terraform1.10.5:           + "Namespace"   = "common"
11:46:29.589 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:46:29.589 STDOUT terraform1.10.5:         }
11:46:29.589 STDOUT terraform1.10.5:       + tags_all         = {
11:46:29.589 STDOUT terraform1.10.5:           + "Environment" = "global"
11:46:29.589 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
11:46:29.589 STDOUT terraform1.10.5:           + "Namespace"   = "common"
11:46:29.589 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:46:29.589 STDOUT terraform1.10.5:         }
11:46:29.589 STDOUT terraform1.10.5:       + vpc_id           = (known after apply)
11:46:29.589 STDOUT terraform1.10.5:     }
11:46:29.589 STDOUT terraform1.10.5:   # module.vpc.aws_route_table.public[0] will be created
11:46:29.590 STDOUT terraform1.10.5:   + resource "aws_route_table" "public" {
11:46:29.590 STDOUT terraform1.10.5:       + arn              = (known after apply)
11:46:29.590 STDOUT terraform1.10.5:       + id               = (known after apply)
11:46:29.590 STDOUT terraform1.10.5:       + owner_id         = (known after apply)
11:46:29.590 STDOUT terraform1.10.5:       + propagating_vgws = (known after apply)
11:46:29.590 STDOUT terraform1.10.5:       + route            = (known after apply)
11:46:29.590 STDOUT terraform1.10.5:       + tags             = {
11:46:29.590 STDOUT terraform1.10.5:           + "Environment" = "global"
11:46:29.590 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
11:46:29.590 STDOUT terraform1.10.5:           + "Namespace"   = "common"
11:46:29.590 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:46:29.590 STDOUT terraform1.10.5:         }
11:46:29.590 STDOUT terraform1.10.5:       + tags_all         = {
11:46:29.590 STDOUT terraform1.10.5:           + "Environment" = "global"
11:46:29.590 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
11:46:29.590 STDOUT terraform1.10.5:           + "Namespace"   = "common"
11:46:29.590 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:46:29.590 STDOUT terraform1.10.5:         }
11:46:29.591 STDOUT terraform1.10.5:       + vpc_id           = (known after apply)
11:46:29.591 STDOUT terraform1.10.5:     }
11:46:29.591 STDOUT terraform1.10.5:   # module.vpc.aws_route_table_association.private[0] will be created
11:46:29.591 STDOUT terraform1.10.5:   + resource "aws_route_table_association" "private" {
11:46:29.591 STDOUT terraform1.10.5:       + id             = (known after apply)
11:46:29.591 STDOUT terraform1.10.5:       + route_table_id = (known after apply)
11:46:29.591 STDOUT terraform1.10.5:       + subnet_id      = (known after apply)
11:46:29.591 STDOUT terraform1.10.5:     }
11:46:29.591 STDOUT terraform1.10.5:   # module.vpc.aws_route_table_association.private[1] will be created
11:46:29.591 STDOUT terraform1.10.5:   + resource "aws_route_table_association" "private" {
11:46:29.591 STDOUT terraform1.10.5:       + id             = (known after apply)
11:46:29.591 STDOUT terraform1.10.5:       + route_table_id = (known after apply)
11:46:29.591 STDOUT terraform1.10.5:       + subnet_id      = (known after apply)
11:46:29.591 STDOUT terraform1.10.5:     }
11:46:29.591 STDOUT terraform1.10.5:   # module.vpc.aws_route_table_association.private[2] will be created
11:46:29.591 STDOUT terraform1.10.5:   + resource "aws_route_table_association" "private" {
11:46:29.591 STDOUT terraform1.10.5:       + id             = (known after apply)
11:46:29.591 STDOUT terraform1.10.5:       + route_table_id = (known after apply)
11:46:29.592 STDOUT terraform1.10.5:       + subnet_id      = (known after apply)
11:46:29.592 STDOUT terraform1.10.5:     }
11:46:29.592 STDOUT terraform1.10.5:   # module.vpc.aws_route_table_association.public[0] will be created
11:46:29.592 STDOUT terraform1.10.5:   + resource "aws_route_table_association" "public" {
11:46:29.592 STDOUT terraform1.10.5:       + id             = (known after apply)
11:46:29.592 STDOUT terraform1.10.5:       + route_table_id = (known after apply)
11:46:29.592 STDOUT terraform1.10.5:       + subnet_id      = (known after apply)
11:46:29.592 STDOUT terraform1.10.5:     }
11:46:29.592 STDOUT terraform1.10.5:   # module.vpc.aws_route_table_association.public[1] will be created
11:46:29.592 STDOUT terraform1.10.5:   + resource "aws_route_table_association" "public" {
11:46:29.592 STDOUT terraform1.10.5:       + id             = (known after apply)
11:46:29.592 STDOUT terraform1.10.5:       + route_table_id = (known after apply)
11:46:29.592 STDOUT terraform1.10.5:       + subnet_id      = (known after apply)
11:46:29.592 STDOUT terraform1.10.5:     }
11:46:29.592 STDOUT terraform1.10.5:   # module.vpc.aws_route_table_association.public[2] will be created
11:46:29.592 STDOUT terraform1.10.5:   + resource "aws_route_table_association" "public" {
11:46:29.592 STDOUT terraform1.10.5:       + id             = (known after apply)
11:46:29.592 STDOUT terraform1.10.5:       + route_table_id = (known after apply)
11:46:29.593 STDOUT terraform1.10.5:       + subnet_id      = (known after apply)
11:46:29.593 STDOUT terraform1.10.5:     }
11:46:29.593 STDOUT terraform1.10.5:   # module.vpc.aws_subnet.private[0] will be created
11:46:29.593 STDOUT terraform1.10.5:   + resource "aws_subnet" "private" {
11:46:29.593 STDOUT terraform1.10.5:       + arn                                            = (known after apply)
11:46:29.593 STDOUT terraform1.10.5:       + assign_ipv6_address_on_creation                = false
11:46:29.593 STDOUT terraform1.10.5:       + availability_zone                              = "eu-central-1a"
11:46:29.593 STDOUT terraform1.10.5:       + availability_zone_id                           = (known after apply)
11:46:29.593 STDOUT terraform1.10.5:       + cidr_block                                     = "10.10.0.0/20"
11:46:29.593 STDOUT terraform1.10.5:       + enable_dns64                                   = false
11:46:29.593 STDOUT terraform1.10.5:       + enable_resource_name_dns_a_record_on_launch    = false
11:46:29.593 STDOUT terraform1.10.5:       + enable_resource_name_dns_aaaa_record_on_launch = false
11:46:29.593 STDOUT terraform1.10.5:       + id                                             = (known after apply)
11:46:29.593 STDOUT terraform1.10.5:       + ipv6_cidr_block_association_id                 = (known after apply)
11:46:29.593 STDOUT terraform1.10.5:       + ipv6_native                                    = false
11:46:29.593 STDOUT terraform1.10.5:       + map_public_ip_on_launch                        = false
11:46:29.594 STDOUT terraform1.10.5:       + owner_id                                       = (known after apply)
11:46:29.594 STDOUT terraform1.10.5:       + private_dns_hostname_type_on_launch            = (known after apply)
11:46:29.594 STDOUT terraform1.10.5:       + tags                                           = {
11:46:29.594 STDOUT terraform1.10.5:           + "Environment"                     = "global"
11:46:29.594 STDOUT terraform1.10.5:           + "Name"                            = "global-common-eu-central-1-dev3"
11:46:29.594 STDOUT terraform1.10.5:           + "Namespace"                       = "common"
11:46:29.594 STDOUT terraform1.10.5:           + "Region"                          = "eu-central-1"
11:46:29.594 STDOUT terraform1.10.5:           + "Subnet"                          = "private"
11:46:29.594 STDOUT terraform1.10.5:           + "kubernetes.io/role/internal-elb" = "1"
11:46:29.594 STDOUT terraform1.10.5:           + "subnet-type"                     = "private"
11:46:29.594 STDOUT terraform1.10.5:         }
11:46:29.594 STDOUT terraform1.10.5:       + tags_all                                       = {
11:46:29.594 STDOUT terraform1.10.5:           + "Environment"                     = "global"
11:46:29.594 STDOUT terraform1.10.5:           + "Name"                            = "global-common-eu-central-1-dev3"
11:46:29.594 STDOUT terraform1.10.5:           + "Namespace"                       = "common"
11:46:29.594 STDOUT terraform1.10.5:           + "Region"                          = "eu-central-1"
11:46:29.595 STDOUT terraform1.10.5:           + "Subnet"                          = "private"
11:46:29.595 STDOUT terraform1.10.5:           + "kubernetes.io/role/internal-elb" = "1"
11:46:29.595 STDOUT terraform1.10.5:           + "subnet-type"                     = "private"
11:46:29.595 STDOUT terraform1.10.5:         }
11:46:29.595 STDOUT terraform1.10.5:       + vpc_id                                         = (known after apply)
11:46:29.595 STDOUT terraform1.10.5:     }
11:46:29.595 STDOUT terraform1.10.5:   # module.vpc.aws_subnet.private[1] will be created
11:46:29.595 STDOUT terraform1.10.5:   + resource "aws_subnet" "private" {
11:46:29.595 STDOUT terraform1.10.5:       + arn                                            = (known after apply)
11:46:29.595 STDOUT terraform1.10.5:       + assign_ipv6_address_on_creation                = false
11:46:29.595 STDOUT terraform1.10.5:       + availability_zone                              = "eu-central-1b"
11:46:29.595 STDOUT terraform1.10.5:       + availability_zone_id                           = (known after apply)
11:46:29.595 STDOUT terraform1.10.5:       + cidr_block                                     = "10.10.16.0/20"
11:46:29.595 STDOUT terraform1.10.5:       + enable_dns64                                   = false
11:46:29.595 STDOUT terraform1.10.5:       + enable_resource_name_dns_a_record_on_launch    = false
11:46:29.596 STDOUT terraform1.10.5:       + enable_resource_name_dns_aaaa_record_on_launch = false
11:46:29.596 STDOUT terraform1.10.5:       + id                                             = (known after apply)
11:46:29.596 STDOUT terraform1.10.5:       + ipv6_cidr_block_association_id                 = (known after apply)
11:46:29.596 STDOUT terraform1.10.5:       + ipv6_native                                    = false
11:46:29.596 STDOUT terraform1.10.5:       + map_public_ip_on_launch                        = false
11:46:29.596 STDOUT terraform1.10.5:       + owner_id                                       = (known after apply)
11:46:29.596 STDOUT terraform1.10.5:       + private_dns_hostname_type_on_launch            = (known after apply)
11:46:29.596 STDOUT terraform1.10.5:       + tags                                           = {
11:46:29.596 STDOUT terraform1.10.5:           + "Environment"                     = "global"
11:46:29.596 STDOUT terraform1.10.5:           + "Name"                            = "global-common-eu-central-1-dev3"
11:46:29.596 STDOUT terraform1.10.5:           + "Namespace"                       = "common"
11:46:29.596 STDOUT terraform1.10.5:           + "Region"                          = "eu-central-1"
11:46:29.596 STDOUT terraform1.10.5:           + "Subnet"                          = "private"
11:46:29.596 STDOUT terraform1.10.5:           + "kubernetes.io/role/internal-elb" = "1"
11:46:29.596 STDOUT terraform1.10.5:           + "subnet-type"                     = "private"
11:46:29.597 STDOUT terraform1.10.5:         }
11:46:29.597 STDOUT terraform1.10.5:       + tags_all                                       = {
11:46:29.597 STDOUT terraform1.10.5:           + "Environment"                     = "global"
11:46:29.597 STDOUT terraform1.10.5:           + "Name"                            = "global-common-eu-central-1-dev3"
11:46:29.597 STDOUT terraform1.10.5:           + "Namespace"                       = "common"
11:46:29.597 STDOUT terraform1.10.5:           + "Region"                          = "eu-central-1"
11:46:29.597 STDOUT terraform1.10.5:           + "Subnet"                          = "private"
11:46:29.597 STDOUT terraform1.10.5:           + "kubernetes.io/role/internal-elb" = "1"
11:46:29.597 STDOUT terraform1.10.5:           + "subnet-type"                     = "private"
11:46:29.597 STDOUT terraform1.10.5:         }
11:46:29.597 STDOUT terraform1.10.5:       + vpc_id                                         = (known after apply)
11:46:29.597 STDOUT terraform1.10.5:     }
11:46:29.597 STDOUT terraform1.10.5:   # module.vpc.aws_subnet.private[2] will be created
11:46:29.597 STDOUT terraform1.10.5:   + resource "aws_subnet" "private" {
11:46:29.597 STDOUT terraform1.10.5:       + arn                                            = (known after apply)
11:46:29.597 STDOUT terraform1.10.5:       + assign_ipv6_address_on_creation                = false
11:46:29.597 STDOUT terraform1.10.5:       + availability_zone                              = "eu-central-1c"
11:46:29.598 STDOUT terraform1.10.5:       + availability_zone_id                           = (known after apply)
11:46:29.598 STDOUT terraform1.10.5:       + cidr_block                                     = "10.10.32.0/20"
11:46:29.598 STDOUT terraform1.10.5:       + enable_dns64                                   = false
11:46:29.598 STDOUT terraform1.10.5:       + enable_resource_name_dns_a_record_on_launch    = false
11:46:29.598 STDOUT terraform1.10.5:       + enable_resource_name_dns_aaaa_record_on_launch = false
11:46:29.598 STDOUT terraform1.10.5:       + id                                             = (known after apply)
11:46:29.598 STDOUT terraform1.10.5:       + ipv6_cidr_block_association_id                 = (known after apply)
11:46:29.598 STDOUT terraform1.10.5:       + ipv6_native                                    = false
11:46:29.598 STDOUT terraform1.10.5:       + map_public_ip_on_launch                        = false
11:46:29.598 STDOUT terraform1.10.5:       + owner_id                                       = (known after apply)
11:46:29.598 STDOUT terraform1.10.5:       + private_dns_hostname_type_on_launch            = (known after apply)
11:46:29.598 STDOUT terraform1.10.5:       + tags                                           = {
11:46:29.598 STDOUT terraform1.10.5:           + "Environment"                     = "global"
11:46:29.598 STDOUT terraform1.10.5:           + "Name"                            = "global-common-eu-central-1-dev3"
11:46:29.598 STDOUT terraform1.10.5:           + "Namespace"                       = "common"
11:46:29.598 STDOUT terraform1.10.5:           + "Region"                          = "eu-central-1"
11:46:29.598 STDOUT terraform1.10.5:           + "Subnet"                          = "private"
11:46:29.598 STDOUT terraform1.10.5:           + "kubernetes.io/role/internal-elb" = "1"
11:46:29.598 STDOUT terraform1.10.5:           + "subnet-type"                     = "private"
11:46:29.598 STDOUT terraform1.10.5:         }
11:46:29.598 STDOUT terraform1.10.5:       + tags_all                                       = {
11:46:29.598 STDOUT terraform1.10.5:           + "Environment"                     = "global"
11:46:29.599 STDOUT terraform1.10.5:           + "Name"                            = "global-common-eu-central-1-dev3"
11:46:29.599 STDOUT terraform1.10.5:           + "Namespace"                       = "common"
11:46:29.599 STDOUT terraform1.10.5:           + "Region"                          = "eu-central-1"
11:46:29.599 STDOUT terraform1.10.5:           + "Subnet"                          = "private"
11:46:29.599 STDOUT terraform1.10.5:           + "kubernetes.io/role/internal-elb" = "1"
11:46:29.599 STDOUT terraform1.10.5:           + "subnet-type"                     = "private"
11:46:29.599 STDOUT terraform1.10.5:         }
11:46:29.599 STDOUT terraform1.10.5:       + vpc_id                                         = (known after apply)
11:46:29.599 STDOUT terraform1.10.5:     }
11:46:29.599 STDOUT terraform1.10.5:   # module.vpc.aws_subnet.public[0] will be created
11:46:29.599 STDOUT terraform1.10.5:   + resource "aws_subnet" "public" {
11:46:29.599 STDOUT terraform1.10.5:       + arn                                            = (known after apply)
11:46:29.599 STDOUT terraform1.10.5:       + assign_ipv6_address_on_creation                = false
11:46:29.599 STDOUT terraform1.10.5:       + availability_zone                              = "eu-central-1a"
11:46:29.599 STDOUT terraform1.10.5:       + availability_zone_id                           = (known after apply)
11:46:29.599 STDOUT terraform1.10.5:       + cidr_block                                     = "10.10.48.0/24"
11:46:29.599 STDOUT terraform1.10.5:       + enable_dns64                                   = false
11:46:29.599 STDOUT terraform1.10.5:       + enable_resource_name_dns_a_record_on_launch    = false
11:46:29.599 STDOUT terraform1.10.5:       + enable_resource_name_dns_aaaa_record_on_launch = false
11:46:29.599 STDOUT terraform1.10.5:       + id                                             = (known after apply)
11:46:29.599 STDOUT terraform1.10.5:       + ipv6_cidr_block_association_id                 = (known after apply)
11:46:29.599 STDOUT terraform1.10.5:       + ipv6_native                                    = false
11:46:29.599 STDOUT terraform1.10.5:       + map_public_ip_on_launch                        = false
11:46:29.599 STDOUT terraform1.10.5:       + owner_id                                       = (known after apply)
11:46:29.599 STDOUT terraform1.10.5:       + private_dns_hostname_type_on_launch            = (known after apply)
11:46:29.599 STDOUT terraform1.10.5:       + tags                                           = {
11:46:29.600 STDOUT terraform1.10.5:           + "Environment"            = "global"
11:46:29.600 STDOUT terraform1.10.5:           + "Name"                   = "global-common-eu-central-1-dev3"
11:46:29.600 STDOUT terraform1.10.5:           + "Namespace"              = "common"
11:46:29.600 STDOUT terraform1.10.5:           + "Region"                 = "eu-central-1"
11:46:29.600 STDOUT terraform1.10.5:           + "Subnet"                 = "public"
11:46:29.600 STDOUT terraform1.10.5:           + "kubernetes.io/role/elb" = "1"
11:46:29.600 STDOUT terraform1.10.5:           + "subnet-type"            = "public"
11:46:29.600 STDOUT terraform1.10.5:         }
11:46:29.600 STDOUT terraform1.10.5:       + tags_all                                       = {
11:46:29.600 STDOUT terraform1.10.5:           + "Environment"            = "global"
11:46:29.600 STDOUT terraform1.10.5:           + "Name"                   = "global-common-eu-central-1-dev3"
11:46:29.600 STDOUT terraform1.10.5:           + "Namespace"              = "common"
11:46:29.600 STDOUT terraform1.10.5:           + "Region"                 = "eu-central-1"
11:46:29.600 STDOUT terraform1.10.5:           + "Subnet"                 = "public"
11:46:29.600 STDOUT terraform1.10.5:           + "kubernetes.io/role/elb" = "1"
11:46:29.600 STDOUT terraform1.10.5:           + "subnet-type"            = "public"
11:46:29.600 STDOUT terraform1.10.5:         }
11:46:29.600 STDOUT terraform1.10.5:       + vpc_id                                         = (known after apply)
11:46:29.600 STDOUT terraform1.10.5:     }
11:46:29.600 STDOUT terraform1.10.5:   # module.vpc.aws_subnet.public[1] will be created
11:46:29.600 STDOUT terraform1.10.5:   + resource "aws_subnet" "public" {
11:46:29.600 STDOUT terraform1.10.5:       + arn                                            = (known after apply)
11:46:29.600 STDOUT terraform1.10.5:       + assign_ipv6_address_on_creation                = false
11:46:29.600 STDOUT terraform1.10.5:       + availability_zone                              = "eu-central-1b"
11:46:29.600 STDOUT terraform1.10.5:       + availability_zone_id                           = (known after apply)
11:46:29.600 STDOUT terraform1.10.5:       + cidr_block                                     = "10.10.49.0/24"
11:46:29.600 STDOUT terraform1.10.5:       + enable_dns64                                   = false
11:46:29.601 STDOUT terraform1.10.5:       + enable_resource_name_dns_a_record_on_launch    = false
11:46:29.601 STDOUT terraform1.10.5:       + enable_resource_name_dns_aaaa_record_on_launch = false
11:46:29.601 STDOUT terraform1.10.5:       + id                                             = (known after apply)
11:46:29.601 STDOUT terraform1.10.5:       + ipv6_cidr_block_association_id                 = (known after apply)
11:46:29.601 STDOUT terraform1.10.5:       + ipv6_native                                    = false
11:46:29.601 STDOUT terraform1.10.5:       + map_public_ip_on_launch                        = false
11:46:29.601 STDOUT terraform1.10.5:       + owner_id                                       = (known after apply)
11:46:29.601 STDOUT terraform1.10.5:       + private_dns_hostname_type_on_launch            = (known after apply)
11:46:29.601 STDOUT terraform1.10.5:       + tags                                           = {
11:46:29.601 STDOUT terraform1.10.5:           + "Environment"            = "global"
11:46:29.601 STDOUT terraform1.10.5:           + "Name"                   = "global-common-eu-central-1-dev3"
11:46:29.601 STDOUT terraform1.10.5:           + "Namespace"              = "common"
11:46:29.601 STDOUT terraform1.10.5:           + "Region"                 = "eu-central-1"
11:46:29.601 STDOUT terraform1.10.5:           + "Subnet"                 = "public"
11:46:29.601 STDOUT terraform1.10.5:           + "kubernetes.io/role/elb" = "1"
11:46:29.601 STDOUT terraform1.10.5:           + "subnet-type"            = "public"
11:46:29.601 STDOUT terraform1.10.5:         }
11:46:29.601 STDOUT terraform1.10.5:       + tags_all                                       = {
11:46:29.601 STDOUT terraform1.10.5:           + "Environment"            = "global"
11:46:29.601 STDOUT terraform1.10.5:           + "Name"                   = "global-common-eu-central-1-dev3"
11:46:29.601 STDOUT terraform1.10.5:           + "Namespace"              = "common"
11:46:29.601 STDOUT terraform1.10.5:           + "Region"                 = "eu-central-1"
11:46:29.601 STDOUT terraform1.10.5:           + "Subnet"                 = "public"
11:46:29.601 STDOUT terraform1.10.5:           + "kubernetes.io/role/elb" = "1"
11:46:29.601 STDOUT terraform1.10.5:           + "subnet-type"            = "public"
11:46:29.601 STDOUT terraform1.10.5:         }
11:46:29.601 STDOUT terraform1.10.5:       + vpc_id                                         = (known after apply)
11:46:29.601 STDOUT terraform1.10.5:     }
11:46:29.601 STDOUT terraform1.10.5:   # module.vpc.aws_subnet.public[2] will be created
11:46:29.602 STDOUT terraform1.10.5:   + resource "aws_subnet" "public" {
11:46:29.602 STDOUT terraform1.10.5:       + arn                                            = (known after apply)
11:46:29.602 STDOUT terraform1.10.5:       + assign_ipv6_address_on_creation                = false
11:46:29.602 STDOUT terraform1.10.5:       + availability_zone                              = "eu-central-1c"
11:46:29.602 STDOUT terraform1.10.5:       + availability_zone_id                           = (known after apply)
11:46:29.602 STDOUT terraform1.10.5:       + cidr_block                                     = "10.10.50.0/24"
11:46:29.602 STDOUT terraform1.10.5:       + enable_dns64                                   = false
11:46:29.602 STDOUT terraform1.10.5:       + enable_resource_name_dns_a_record_on_launch    = false
11:46:29.602 STDOUT terraform1.10.5:       + enable_resource_name_dns_aaaa_record_on_launch = false
11:46:29.602 STDOUT terraform1.10.5:       + id                                             = (known after apply)
11:46:29.602 STDOUT terraform1.10.5:       + ipv6_cidr_block_association_id                 = (known after apply)
11:46:29.602 STDOUT terraform1.10.5:       + ipv6_native                                    = false
11:46:29.602 STDOUT terraform1.10.5:       + map_public_ip_on_launch                        = false
11:46:29.602 STDOUT terraform1.10.5:       + owner_id                                       = (known after apply)
11:46:29.602 STDOUT terraform1.10.5:       + private_dns_hostname_type_on_launch            = (known after apply)
11:46:29.602 STDOUT terraform1.10.5:       + tags                                           = {
11:46:29.602 STDOUT terraform1.10.5:           + "Environment"            = "global"
11:46:29.602 STDOUT terraform1.10.5:           + "Name"                   = "global-common-eu-central-1-dev3"
11:46:29.602 STDOUT terraform1.10.5:           + "Namespace"              = "common"
11:46:29.602 STDOUT terraform1.10.5:           + "Region"                 = "eu-central-1"
11:46:29.602 STDOUT terraform1.10.5:           + "Subnet"                 = "public"
11:46:29.602 STDOUT terraform1.10.5:           + "kubernetes.io/role/elb" = "1"
11:46:29.602 STDOUT terraform1.10.5:           + "subnet-type"            = "public"
11:46:29.602 STDOUT terraform1.10.5:         }
11:46:29.602 STDOUT terraform1.10.5:       + tags_all                                       = {
11:46:29.603 STDOUT terraform1.10.5:           + "Environment"            = "global"
11:46:29.603 STDOUT terraform1.10.5:           + "Name"                   = "global-common-eu-central-1-dev3"
11:46:29.603 STDOUT terraform1.10.5:           + "Namespace"              = "common"
11:46:29.603 STDOUT terraform1.10.5:           + "Region"                 = "eu-central-1"
11:46:29.603 STDOUT terraform1.10.5:           + "Subnet"                 = "public"
11:46:29.603 STDOUT terraform1.10.5:           + "kubernetes.io/role/elb" = "1"
11:46:29.603 STDOUT terraform1.10.5:           + "subnet-type"            = "public"
11:46:29.603 STDOUT terraform1.10.5:         }
11:46:29.603 STDOUT terraform1.10.5:       + vpc_id                                         = (known after apply)
11:46:29.603 STDOUT terraform1.10.5:     }
11:46:29.603 STDOUT terraform1.10.5:   # module.vpc.aws_vpc.this[0] will be created
11:46:29.603 STDOUT terraform1.10.5:   + resource "aws_vpc" "this" {
11:46:29.603 STDOUT terraform1.10.5:       + arn                                  = (known after apply)
11:46:29.603 STDOUT terraform1.10.5:       + cidr_block                           = "10.10.0.0/16"
11:46:29.603 STDOUT terraform1.10.5:       + default_network_acl_id               = (known after apply)
11:46:29.603 STDOUT terraform1.10.5:       + default_route_table_id               = (known after apply)
11:46:29.603 STDOUT terraform1.10.5:       + default_security_group_id            = (known after apply)
11:46:29.603 STDOUT terraform1.10.5:       + dhcp_options_id                      = (known after apply)
11:46:29.603 STDOUT terraform1.10.5:       + enable_dns_hostnames                 = true
11:46:29.603 STDOUT terraform1.10.5:       + enable_dns_support                   = true
11:46:29.603 STDOUT terraform1.10.5:       + enable_network_address_usage_metrics = (known after apply)
11:46:29.603 STDOUT terraform1.10.5:       + id                                   = (known after apply)
11:46:29.603 STDOUT terraform1.10.5:       + instance_tenancy                     = "default"
11:46:29.603 STDOUT terraform1.10.5:       + ipv6_association_id                  = (known after apply)
11:46:29.603 STDOUT terraform1.10.5:       + ipv6_cidr_block                      = (known after apply)
11:46:29.603 STDOUT terraform1.10.5:       + ipv6_cidr_block_network_border_group = (known after apply)
11:46:29.603 STDOUT terraform1.10.5:       + main_route_table_id                  = (known after apply)
11:46:29.603 STDOUT terraform1.10.5:       + owner_id                             = (known after apply)
11:46:29.672 STDOUT terraform1.10.5:       + tags                                 = {
11:46:29.672 STDOUT terraform1.10.5:           + "Environment" = "global"
11:46:29.672 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
11:46:29.672 STDOUT terraform1.10.5:           + "Namespace"   = "common"
11:46:29.672 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:46:29.672 STDOUT terraform1.10.5:         }
11:46:29.672 STDOUT terraform1.10.5:       + tags_all                             = {
11:46:29.672 STDOUT terraform1.10.5:           + "Environment" = "global"
11:46:29.672 STDOUT terraform1.10.5:           + "Name"        = "global-common-eu-central-1-dev3"
11:46:29.672 STDOUT terraform1.10.5:           + "Namespace"   = "common"
11:46:29.672 STDOUT terraform1.10.5:           + "Region"      = "eu-central-1"
11:46:29.672 STDOUT terraform1.10.5:         }
11:46:29.672 STDOUT terraform1.10.5:     }
11:46:29.672 STDOUT terraform1.10.5: Plan: 23 to add, 0 to change, 0 to destroy.
11:46:29.672 STDOUT terraform1.10.5: 
11:46:29.673 STDOUT terraform1.10.5: Changes to Outputs:
11:46:29.673 STDOUT terraform1.10.5:   + account_id      = "052701461513"
11:46:29.673 STDOUT terraform1.10.5:   + private_subnets = [
11:46:29.673 STDOUT terraform1.10.5:       + (known after apply),
11:46:29.673 STDOUT terraform1.10.5:       + (known after apply),
11:46:29.673 STDOUT terraform1.10.5:       + (known after apply),
11:46:29.673 STDOUT terraform1.10.5:     ]
11:46:29.673 STDOUT terraform1.10.5:   + public_subnets  = [
11:46:29.673 STDOUT terraform1.10.5:       + (known after apply),
11:46:29.673 STDOUT terraform1.10.5:       + (known after apply),
11:46:29.673 STDOUT terraform1.10.5:       + (known after apply),
11:46:29.673 STDOUT terraform1.10.5:     ]
11:46:29.673 STDOUT terraform1.10.5:   + vpc_cidr_block  = "10.10.0.0/16"
11:46:29.673 STDOUT terraform1.10.5:   + vpc_id          = (known after apply)
11:46:29.673 STDOUT terraform1.10.5:   + vpc_name        = "global-common-eu-central-1-dev3"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d devops-dev/global/eu-central-1/common/vpc/dev3 -w devops-dev_global_eu-central-1_common_vpc_dev3
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://global-common-eu-central-1-atlantis.skeleton-dev.testenv.io/lock?id=cryptocat-org%252Fdevops-digger%252Fdevops-dev%252Fglobal%252Feu-central-1%252Fcommon%252Fvpc%252Fdev3%252Fdevops-dev_global_eu-central-1_common_vpc_dev3)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d devops-dev/global/eu-central-1/common/vpc/dev3 -w devops-dev_global_eu-central-1_common_vpc_dev3
  ```
Plan: 23 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```